Catalogs/ПравилаПредставленияОтчетовУплатыНалогов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>ПравилаПредставленияОтчетовУплатыНалогов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ЗадачиБухгалтера</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДействийКалендаряБухгалтера</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФинансовыйПериод</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОграничениеПериода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>24</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокМесяцев</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокМожетЗакончитьсяВВыходной</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БазовыйПериод</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтставаниеБазовогоПериода</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьИнформацияНаИТС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Условия</Name>
					<Comment>объединяются по "И"</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Условие</Name>
							<Type>
								<v8:Type>cfg:EnumRef.УсловияПримененияТребованийЗаконодательства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ПравилаПредставленияОтчетовУплатыНалогов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

&НаКлиенте
Процедура ДействиеПриИзменении(Элемент)
	НастроитьДоступностьПериодаДекларации(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ПовторятьНесколькоРазПриИзменении(Элемент)
	
	НастроитьДоступностьПериодичности(ЭтаФорма);
	Если Не ПовторятьНесколькоРаз Тогда
		Объект.Периодичность = Объект.ФинансовыйПериод;
		Объект.ОграничениеПериода = "";
		ЗаданоОграничениеПериода = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ФинансовыйПериодПриИзменении(Элемент)
	
	Если Не ЗначениеЗаполнено(Объект.Периодичность) Тогда
		Объект.Периодичность = Объект.ФинансовыйПериод;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаданоОграничениеПериодаПриИзменении(Элемент)
	
	НастроитьДоступностьОграничениеПериода(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОграничениеПериодаПриИзменении(Элемент)
	
	Если ПустаяСтрока(Объект.ОграничениеПериода) Тогда
		ЗаданоОграничениеПериода = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтандартныйБазовыйПериодПриИзменении(Элемент)
	
	НастроитьДоступностьВариантовБазовогоПериода(ЭтаФорма);
	Если СтандартныйБазовыйПериод = 1 Тогда
		Объект.ОтставаниеБазовогоПериода = 0;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НестандартныйБазовыйПериодРанееПриИзменении(Элемент)
	
	НастроитьДоступностьВариантовБазовогоПериода(ЭтаФорма);
	Если СтандартныйБазовыйПериод = 0 Тогда
		Объект.ОтставаниеБазовогоПериода = 1;
	КонецЕсли;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

////////////////////////////////////////////////////////////////////////////////
// Настройка формы

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьДоступностьПериодаДекларации(Форма)
	
	УплатаНалога = ПредопределенноеЗначение("Перечисление.ВидыДействийКалендаряБухгалтера.УплатаНалога");
	Форма.Элементы.ПериодДекларации.Доступность = (Форма.Объект.Действие = УплатаНалога);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьДоступностьПериодичности(Форма)
	
	Форма.Элементы.ПериодичностьГруппа.Доступность = Форма.ПовторятьНесколькоРаз;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьДоступностьОграничениеПериода(Форма)
	
	Форма.Элементы.ОграничениеПериода.Доступность = Форма.ЗаданоОграничениеПериода;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьДоступностьВариантовБазовогоПериода(Форма)
	
	СтандартныйБазовыйПериод = (Форма.СтандартныйБазовыйПериод = 1);
	Форма.Элементы.БазовыйПериод.Доступность             = СтандартныйБазовыйПериод;
	Форма.Элементы.БазовыйПериодРанее.Доступность        = Не СтандартныйБазовыйПериод;
	Форма.Элементы.ОтставаниеБазовогоПериода.Доступность = Не СтандартныйБазовыйПериод;
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Прочее

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	// Заполним параметры формы
	ПовторятьНесколькоРаз    = (Объект.Периодичность <> Объект.ФинансовыйПериод);
	ЗаданоОграничениеПериода = Не ПустаяСтрока(Объект.ОграничениеПериода);
	СтандартныйБазовыйПериод = (Объект.ОтставаниеБазовогоПериода = 0);
	
	// Настроим форму
	НастроитьДоступностьПериодаДекларации(ЭтаФорма);
	НастроитьДоступностьПериодичности(ЭтаФорма);
	НастроитьДоступностьОграничениеПериода(ЭтаФорма);
	НастроитьДоступностьВариантовБазовогоПериода(ЭтаФорма);

КонецПроцедуры
